GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k22.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_P2B_POSN                           equ 0002h
PORTD_P2B_POSITION                       equ 0002h
PORTD_P2B_SIZE                           equ 0001h
PORTD_P2B_LENGTH                         equ 0001h
PORTD_P2B_MASK                           equ 0004h
PORTD_P2C_POSN                           equ 0003h
PORTD_P2C_POSITION                       equ 0003h
PORTD_P2C_SIZE                           equ 0001h
PORTD_P2C_LENGTH                         equ 0001h
PORTD_P2C_MASK                           equ 0008h
PORTD_P2D_POSN                           equ 0004h
PORTD_P2D_POSITION                       equ 0004h
PORTD_P2D_SIZE                           equ 0001h
PORTD_P2D_LENGTH                         equ 0001h
PORTD_P2D_MASK                           equ 0010h
PORTD_P1B_POSN                           equ 0005h
PORTD_P1B_POSITION                       equ 0005h
PORTD_P1B_SIZE                           equ 0001h
PORTD_P1B_LENGTH                         equ 0001h
PORTD_P1B_MASK                           equ 0020h
PORTD_P1C_POSN                           equ 0006h
PORTD_P1C_POSITION                       equ 0006h
PORTD_P1C_SIZE                           equ 0001h
PORTD_P1C_LENGTH                         equ 0001h
PORTD_P1C_MASK                           equ 0040h
PORTD_P1D_POSN                           equ 0007h
PORTD_P1D_POSITION                       equ 0007h
PORTD_P1D_SIZE                           equ 0001h
PORTD_P1D_LENGTH                         equ 0001h
PORTD_P1D_MASK                           equ 0080h
PORTD_CCP4_POSN                          equ 0001h
PORTD_CCP4_POSITION                      equ 0001h
PORTD_CCP4_SIZE                          equ 0001h
PORTD_CCP4_LENGTH                        equ 0001h
PORTD_CCP4_MASK                          equ 0002h
PORTD_TX2_POSN                           equ 0006h
PORTD_TX2_POSITION                       equ 0006h
PORTD_TX2_SIZE                           equ 0001h
PORTD_TX2_LENGTH                         equ 0001h
PORTD_TX2_MASK                           equ 0040h
PORTD_RX2_POSN                           equ 0007h
PORTD_RX2_POSITION                       equ 0007h
PORTD_RX2_SIZE                           equ 0001h
PORTD_RX2_LENGTH                         equ 0001h
PORTD_RX2_MASK                           equ 0080h
PORTD_NOT_SS2_POSN                       equ 0003h
PORTD_NOT_SS2_POSITION                   equ 0003h
PORTD_NOT_SS2_SIZE                       equ 0001h
PORTD_NOT_SS2_LENGTH                     equ 0001h
PORTD_NOT_SS2_MASK                       equ 0008h
PORTD_SCK2_POSN                          equ 0000h
PORTD_SCK2_POSITION                      equ 0000h
PORTD_SCK2_SIZE                          equ 0001h
PORTD_SCK2_LENGTH                        equ 0001h
PORTD_SCK2_MASK                          equ 0001h
PORTD_SDI2_POSN                          equ 0001h
PORTD_SDI2_POSITION                      equ 0001h
PORTD_SDI2_SIZE                          equ 0001h
PORTD_SDI2_LENGTH                        equ 0001h
PORTD_SDI2_MASK                          equ 0002h
PORTD_nSS2_POSN                          equ 0003h
PORTD_nSS2_POSITION                      equ 0003h
PORTD_nSS2_SIZE                          equ 0001h
PORTD_nSS2_LENGTH                        equ 0001h
PORTD_nSS2_MASK                          equ 0008h
PORTD_SDO2_POSN                          equ 0004h
PORTD_SDO2_POSITION                      equ 0004h
PORTD_SDO2_SIZE                          equ 0001h
PORTD_SDO2_LENGTH                        equ 0001h
PORTD_SDO2_MASK                          equ 0010h
PORTD_CK2_POSN                           equ 0006h
PORTD_CK2_POSITION                       equ 0006h
PORTD_CK2_SIZE                           equ 0001h
PORTD_CK2_LENGTH                         equ 0001h
PORTD_CK2_MASK                           equ 0040h
PORTD_DT2_POSN                           equ 0007h
PORTD_DT2_POSITION                       equ 0007h
PORTD_DT2_SIZE                           equ 0001h
PORTD_DT2_LENGTH                         equ 0001h
PORTD_DT2_MASK                           equ 0080h
PORTD_SCL2_POSN                          equ 0000h
PORTD_SCL2_POSITION                      equ 0000h
PORTD_SCL2_SIZE                          equ 0001h
PORTD_SCL2_LENGTH                        equ 0001h
PORTD_SCL2_MASK                          equ 0001h
PORTD_SDA2_POSN                          equ 0001h
PORTD_SDA2_POSITION                      equ 0001h
PORTD_SDA2_SIZE                          equ 0001h
PORTD_SDA2_LENGTH                        equ 0001h
PORTD_SDA2_MASK                          equ 0002h
PORTD_SS2_POSN                           equ 0003h
PORTD_SS2_POSITION                       equ 0003h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0008h
PORTD_AN20_POSN                          equ 0000h
PORTD_AN20_POSITION                      equ 0000h
PORTD_AN20_SIZE                          equ 0001h
PORTD_AN20_LENGTH                        equ 0001h
PORTD_AN20_MASK                          equ 0001h
PORTD_AN21_POSN                          equ 0001h
PORTD_AN21_POSITION                      equ 0001h
PORTD_AN21_SIZE                          equ 0001h
PORTD_AN21_LENGTH                        equ 0001h
PORTD_AN21_MASK                          equ 0002h
PORTD_AN22_POSN                          equ 0002h
PORTD_AN22_POSITION                      equ 0002h
PORTD_AN22_SIZE                          equ 0001h
PORTD_AN22_LENGTH                        equ 0001h
PORTD_AN22_MASK                          equ 0004h
PORTD_AN23_POSN                          equ 0003h
PORTD_AN23_POSITION                      equ 0003h
PORTD_AN23_SIZE                          equ 0001h
PORTD_AN23_LENGTH                        equ 0001h
PORTD_AN23_MASK                          equ 0008h
PORTD_AN24_POSN                          equ 0004h
PORTD_AN24_POSITION                      equ 0004h
PORTD_AN24_SIZE                          equ 0001h
PORTD_AN24_LENGTH                        equ 0001h
PORTD_AN24_MASK                          equ 0010h
PORTD_AN25_POSN                          equ 0005h
PORTD_AN25_POSITION                      equ 0005h
PORTD_AN25_SIZE                          equ 0001h
PORTD_AN25_LENGTH                        equ 0001h
PORTD_AN25_MASK                          equ 0020h
PORTD_AN26_POSN                          equ 0006h
PORTD_AN26_POSITION                      equ 0006h
PORTD_AN26_SIZE                          equ 0001h
PORTD_AN26_LENGTH                        equ 0001h
PORTD_AN26_MASK                          equ 0040h
PORTD_AN27_POSN                          equ 0007h
PORTD_AN27_POSITION                      equ 0007h
PORTD_AN27_SIZE                          equ 0001h
PORTD_AN27_LENGTH                        equ 0001h
PORTD_AN27_MASK                          equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_AN5_POSN                           equ 0000h
PORTE_AN5_POSITION                       equ 0000h
PORTE_AN5_SIZE                           equ 0001h
PORTE_AN5_LENGTH                         equ 0001h
PORTE_AN5_MASK                           equ 0001h
PORTE_AN6_POSN                           equ 0001h
PORTE_AN6_POSITION                       equ 0001h
PORTE_AN6_SIZE                           equ 0001h
PORTE_AN6_LENGTH                         equ 0001h
PORTE_AN6_MASK                           equ 0002h
PORTE_AN7_POSN                           equ 0002h
PORTE_AN7_POSITION                       equ 0002h
PORTE_AN7_SIZE                           equ 0001h
PORTE_AN7_LENGTH                         equ 0001h
PORTE_AN7_MASK                           equ 0004h
PORTE_MCLR_POSN                          equ 0003h
PORTE_MCLR_POSITION                      equ 0003h
PORTE_MCLR_SIZE                          equ 0001h
PORTE_MCLR_LENGTH                        equ 0001h
PORTE_MCLR_MASK                          equ 0008h
PORTE_NOT_MCLR_POSN                      equ 0003h
PORTE_NOT_MCLR_POSITION                  equ 0003h
PORTE_NOT_MCLR_SIZE                      equ 0001h
PORTE_NOT_MCLR_LENGTH                    equ 0001h
PORTE_NOT_MCLR_MASK                      equ 0008h
PORTE_P3A_POSN                           equ 0000h
PORTE_P3A_POSITION                       equ 0000h
PORTE_P3A_SIZE                           equ 0001h
PORTE_P3A_LENGTH                         equ 0001h
PORTE_P3A_MASK                           equ 0001h
PORTE_P3B_POSN                           equ 0001h
PORTE_P3B_POSITION                       equ 0001h
PORTE_P3B_SIZE                           equ 0001h
PORTE_P3B_LENGTH                         equ 0001h
PORTE_P3B_MASK                           equ 0002h
PORTE_CCP5_POSN                          equ 0002h
PORTE_CCP5_POSITION                      equ 0002h
PORTE_CCP5_SIZE                          equ 0001h
PORTE_CCP5_LENGTH                        equ 0001h
PORTE_CCP5_MASK                          equ 0004h
PORTE_nMCLR_POSN                         equ 0003h
PORTE_nMCLR_POSITION                     equ 0003h
PORTE_nMCLR_SIZE                         equ 0001h
PORTE_nMCLR_LENGTH                       equ 0001h
PORTE_nMCLR_MASK                         equ 0008h
PORTE_CCP3_POSN                          equ 0000h
PORTE_CCP3_POSITION                      equ 0000h
PORTE_CCP3_SIZE                          equ 0001h
PORTE_CCP3_LENGTH                        equ 0001h
PORTE_CCP3_MASK                          equ 0001h
PORTE_VPP_POSN                           equ 0003h
PORTE_VPP_POSITION                       equ 0003h
PORTE_VPP_SIZE                           equ 0001h
PORTE_VPP_LENGTH                         equ 0001h
PORTE_VPP_MASK                           equ 0008h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_CCP10_POSN                         equ 0002h
PORTE_CCP10_POSITION                     equ 0002h
PORTE_CCP10_SIZE                         equ 0001h
PORTE_CCP10_LENGTH                       equ 0001h
PORTE_CCP10_MASK                         equ 0004h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_CS_POSN                            equ 0002h
PORTE_CS_POSITION                        equ 0002h
PORTE_CS_SIZE                            equ 0001h
PORTE_CS_LENGTH                          equ 0001h
PORTE_CS_MASK                            equ 0004h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h
PORTE_PB2_POSN                           equ 0002h
PORTE_PB2_POSITION                       equ 0002h
PORTE_PB2_SIZE                           equ 0001h
PORTE_PB2_LENGTH                         equ 0001h
PORTE_PB2_MASK                           equ 0004h

