GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k22.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h
// bitfield definitions
PCL_PCL_POSN                             equ 0000h
PCL_PCL_POSITION                         equ 0000h
PCL_PCL_SIZE                             equ 0008h
PCL_PCL_LENGTH                           equ 0008h
PCL_PCL_MASK                             equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh
// bitfield definitions
PCLATH_PCH_POSN                          equ 0000h
PCLATH_PCH_POSITION                      equ 0000h
PCLATH_PCH_SIZE                          equ 0008h
PCLATH_PCH_LENGTH                        equ 0008h
PCLATH_PCH_MASK                          equ 00FFh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN1                           BANKMASK(BAUDCON1), 0, a
#define ABDEN2                           BANKMASK(BAUDCON2), 0, a
#define ABDOVF1                          BANKMASK(BAUDCON1), 7, a
#define ABDOVF2                          BANKMASK(BAUDCON2), 7, a
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKDT2                           BANKMASK(SSP2CON2), 5, a
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKEN2                           BANKMASK(SSP2CON2), 4, a
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6, a
#define ACQT0                            BANKMASK(ADCON2), 3, a
#define ACQT1                            BANKMASK(ADCON2), 4, a
#define ACQT2                            BANKMASK(ADCON2), 5, a
#define ACSS                             BANKMASK(TBLPTRU), 5, a
#define ADCMD                            BANKMASK(PMD2), 0, b
#define ADCS0                            BANKMASK(ADCON2), 0, a
#define ADCS1                            BANKMASK(ADCON2), 1, a
#define ADCS2                            BANKMASK(ADCON2), 2, a
#define ADDEN1                           BANKMASK(RCSTA1), 3, a
#define ADDEN2                           BANKMASK(RCSTA2), 3, a
#define ADFM                             BANKMASK(ADCON2), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADMSK1                           BANKMASK(SSP1CON2), 1, a
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK12                          BANKMASK(SSP2CON2), 1, a
#define ADMSK2                           BANKMASK(SSP1CON2), 2, a
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK22                          BANKMASK(SSP2CON2), 2, a
#define ADMSK3                           BANKMASK(SSP1CON2), 3, a
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK32                          BANKMASK(SSP2CON2), 3, a
#define ADMSK4                           BANKMASK(SSP1CON2), 4, a
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK42                          BANKMASK(SSP2CON2), 4, a
#define ADMSK5                           BANKMASK(SSP1CON2), 5, a
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADMSK52                          BANKMASK(SSP2CON2), 5, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN10                             BANKMASK(PORTB), 1, a
#define AN11                             BANKMASK(PORTB), 4, a
#define AN12                             BANKMASK(PORTB), 0, a
#define AN13                             BANKMASK(PORTB), 5, a
#define AN14                             BANKMASK(PORTC), 2, a
#define AN15                             BANKMASK(PORTC), 3, a
#define AN16                             BANKMASK(PORTC), 4, a
#define AN17                             BANKMASK(PORTC), 5, a
#define AN18                             BANKMASK(PORTC), 6, a
#define AN19                             BANKMASK(PORTC), 7, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN20                             BANKMASK(PORTD), 0, a
#define AN21                             BANKMASK(PORTD), 1, a
#define AN22                             BANKMASK(PORTD), 2, a
#define AN23                             BANKMASK(PORTD), 3, a
#define AN24                             BANKMASK(PORTD), 4, a
#define AN25                             BANKMASK(PORTD), 5, a
#define AN26                             BANKMASK(PORTD), 6, a
#define AN27                             BANKMASK(PORTD), 7, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define AN5                              BANKMASK(PORTE), 0, a
#define AN6                              BANKMASK(PORTE), 1, a
#define AN7                              BANKMASK(PORTE), 2, a
#define AN8                              BANKMASK(PORTB), 2, a
#define AN9                              BANKMASK(PORTB), 3, a
#define ANSA0                            BANKMASK(ANSELA), 0, b
#define ANSA1                            BANKMASK(ANSELA), 1, b
#define ANSA2                            BANKMASK(ANSELA), 2, b
#define ANSA3                            BANKMASK(ANSELA), 3, b
#define ANSA5                            BANKMASK(ANSELA), 5, b
#define ANSB0                            BANKMASK(ANSELB), 0, b
#define ANSB1                            BANKMASK(ANSELB), 1, b
#define ANSB2                            BANKMASK(ANSELB), 2, b
#define ANSB3                            BANKMASK(ANSELB), 3, b
#define ANSB4                            BANKMASK(ANSELB), 4, b
#define ANSB5                            BANKMASK(ANSELB), 5, b
#define ANSC2                            BANKMASK(ANSELC), 2, b
#define ANSC3                            BANKMASK(ANSELC), 3, b
#define ANSC4                            BANKMASK(ANSELC), 4, b
#define ANSC5                            BANKMASK(ANSELC), 5, b
#define ANSC6                            BANKMASK(ANSELC), 6, b
#define ANSC7                            BANKMASK(ANSELC), 7, b
#define ANSD0                            BANKMASK(ANSELD), 0, b
#define ANSD1                            BANKMASK(ANSELD), 1, b
#define ANSD2                            BANKMASK(ANSELD), 2, b
#define ANSD3                            BANKMASK(ANSELD), 3, b
#define ANSD4                            BANKMASK(ANSELD), 4, b
#define ANSD5                            BANKMASK(ANSELD), 5, b
#define ANSD6                            BANKMASK(ANSELD), 6, b
#define ANSD7                            BANKMASK(ANSELD), 7, b
#define ANSE0                            BANKMASK(ANSELE), 0, b
#define ANSE1                            BANKMASK(ANSELE), 1, b
#define ANSE2                            BANKMASK(ANSELE), 2, b
#define BCL1IE                           BANKMASK(PIE2), 3, a
#define BCL1IF                           BANKMASK(PIR2), 3, a
#define BCL1IP                           BANKMASK(IPR2), 3, a
#define BCL2IE                           BANKMASK(PIE3), 6, a
#define BCL2IF                           BANKMASK(PIR3), 6, a
#define BCL2IP                           BANKMASK(IPR3), 6, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, a
#define BGST                             BANKMASK(HLVDCON), 5, a
#define BGVST                            BANKMASK(HLVDCON), 6, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG162                           BANKMASK(BAUDCON2), 3, a
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BRGH2                            BANKMASK(TXSTA2), 2, a
#define C12IN0M                          BANKMASK(PORTA), 0, a
#define C12IN0N                          BANKMASK(PORTA), 0, a
#define C12IN1M                          BANKMASK(PORTA), 1, a
#define C12IN1N                          BANKMASK(PORTA), 1, a
#define C12IN2M                          BANKMASK(PORTB), 3, a
#define C12IN2N                          BANKMASK(PORTB), 3, a
#define C12IN3M                          BANKMASK(PORTB), 1, a
#define C12IN3N                          BANKMASK(PORTB), 1, a
#define C1CH0                            BANKMASK(CM1CON0), 0, a
#define C1CH1                            BANKMASK(CM1CON0), 1, a
#define C1HYS                            BANKMASK(CM2CON1), 3, a
#define C1IE                             BANKMASK(PIE2), 6, a
#define C1IF                             BANKMASK(PIR2), 6, a
#define C1INP                            BANKMASK(PORTA), 3, a
#define C1IP                             BANKMASK(IPR2), 6, a
#define C1OE                             BANKMASK(CM1CON0), 5, a
#define C1ON                             BANKMASK(CM1CON0), 7, a
#define C1POL                            BANKMASK(CM1CON0), 4, a
#define C1R                              BANKMASK(CM1CON0), 2, a
#define C1RSEL                           BANKMASK(CM2CON1), 5, a
#define C1SP                             BANKMASK(CM1CON0), 3, a
#define C1SYNC                           BANKMASK(CM2CON1), 1, a
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2CH0                            BANKMASK(CM2CON0), 0, a
#define C2CH1                            BANKMASK(CM2CON0), 1, a
#define C2HYS                            BANKMASK(CM2CON1), 2, a
#define C2IE                             BANKMASK(PIE2), 5, a
#define C2IF                             BANKMASK(PIR2), 5, a
#define C2INP                            BANKMASK(PORTA), 2, a
#define C2IP                             BANKMASK(IPR2), 5, a
#define C2OE                             BANKMASK(CM2CON0), 5, a
#define C2ON                             BANKMASK(CM2CON0), 7, a
#define C2POL                            BANKMASK(CM2CON0), 4, a
#define C2R                              BANKMASK(CM2CON0), 2, a
#define C2RSEL                           BANKMASK(CM2CON1), 4, a
#define C2SP                             BANKMASK(CM2CON0), 3, a
#define C2SYNC                           BANKMASK(CM2CON1), 0, a
#define C2TSEL0                          BANKMASK(CCPTMRS0), 3, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 4, b
#define C3TSEL0                          BANKMASK(CCPTMRS0), 6, b
#define C3TSEL1                          BANKMASK(CCPTMRS0), 7, b
#define C4TSEL0                          BANKMASK(CCPTMRS1), 0, b
#define C4TSEL1                          BANKMASK(CCPTMRS1), 1, b
#define C5TSEL0                          BANKMASK(CCPTMRS1), 2, b
#define C5TSEL1                          BANKMASK(CCPTMRS1), 3, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH0                             BANKMASK(CM1CON0), 0, a
#define CCH01                            BANKMASK(CM1CON0), 0, a
#define CCH02                            BANKMASK(CM2CON0), 0, a
#define CCH05                            BANKMASK(IPR5), 0, a
#define CCH1                             BANKMASK(CM1CON0), 1, a
#define CCH11                            BANKMASK(CM1CON0), 1, a
#define CCH12                            BANKMASK(CM2CON0), 1, a
#define CCH15                            BANKMASK(IPR5), 1, a
#define CCIP3IP                          BANKMASK(IPR4), 0, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP10                            BANKMASK(PORTE), 2, a
#define CCP1AS0                          BANKMASK(ECCP1AS), 4, a
#define CCP1AS1                          BANKMASK(ECCP1AS), 5, a
#define CCP1AS2                          BANKMASK(ECCP1AS), 6, a
#define CCP1ASE                          BANKMASK(ECCP1AS), 7, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1MD                           BANKMASK(PMD1), 0, b
#define CCP2AS0                          BANKMASK(ECCP2AS), 4, a
#define CCP2AS1                          BANKMASK(ECCP2AS), 5, a
#define CCP2AS2                          BANKMASK(ECCP2AS), 6, a
#define CCP2ASE                          BANKMASK(ECCP2AS), 7, a
#define CCP2IE                           BANKMASK(PIE2), 0, a
#define CCP2IF                           BANKMASK(PIR2), 0, a
#define CCP2IP                           BANKMASK(IPR2), 0, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, a
#define CCP2M1                           BANKMASK(CCP2CON), 1, a
#define CCP2M2                           BANKMASK(CCP2CON), 2, a
#define CCP2M3                           BANKMASK(CCP2CON), 3, a
#define CCP2MD                           BANKMASK(PMD1), 1, b
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3AS0                          BANKMASK(ECCP3AS), 4, b
#define CCP3AS1                          BANKMASK(ECCP3AS), 5, b
#define CCP3AS2                          BANKMASK(ECCP3AS), 6, b
#define CCP3ASE                          BANKMASK(ECCP3AS), 7, b
#define CCP3IE                           BANKMASK(PIE4), 0, a
#define CCP3IF                           BANKMASK(PIR4), 0, a
#define CCP3IP                           BANKMASK(IPR4), 0, a
#define CCP3M0                           BANKMASK(CCP3CON), 0, b
#define CCP3M1                           BANKMASK(CCP3CON), 1, b
#define CCP3M2                           BANKMASK(CCP3CON), 2, b
#define CCP3M3                           BANKMASK(CCP3CON), 3, b
#define CCP3MD                           BANKMASK(PMD1), 2, b
#define CCP4                             BANKMASK(PORTD), 1, a
#define CCP4IE                           BANKMASK(PIE4), 1, a
#define CCP4IF                           BANKMASK(PIR4), 1, a
#define CCP4IP                           BANKMASK(IPR4), 1, a
#define CCP4M0                           BANKMASK(CCP4CON), 0, b
#define CCP4M1                           BANKMASK(CCP4CON), 1, b
#define CCP4M2                           BANKMASK(CCP4CON), 2, b
#define CCP4M3                           BANKMASK(CCP4CON), 3, b
#define CCP4MD                           BANKMASK(PMD1), 3, b
#define CCP5                             BANKMASK(PORTE), 2, a
#define CCP5IE                           BANKMASK(PIE4), 2, a
#define CCP5IF                           BANKMASK(PIR4), 2, a
#define CCP5IP                           BANKMASK(IPR4), 2, a
#define CCP5M0                           BANKMASK(CCP5CON), 0, b
#define CCP5M1                           BANKMASK(CCP5CON), 1, b
#define CCP5M2                           BANKMASK(CCP5CON), 2, b
#define CCP5M3                           BANKMASK(CCP5CON), 3, b
#define CCP5MD                           BANKMASK(PMD1), 4, b
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHS4                             BANKMASK(ADCON0), 6, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK                               BANKMASK(PORTC), 6, a
#define CK1                              BANKMASK(PORTC), 6, a
#define CK2                              BANKMASK(PORTD), 6, a
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, a
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, a
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define CMP1MD                           BANKMASK(PMD2), 1, b
#define CMP2MD                           BANKMASK(PMD2), 2, b
#define COE                              BANKMASK(CM1CON0), 6, a
#define COE1                             BANKMASK(CM1CON0), 6, a
#define COE2                             BANKMASK(CM2CON0), 6, a
#define CON                              BANKMASK(CM1CON0), 7, a
#define CON1                             BANKMASK(CM1CON0), 7, a
#define CON2                             BANKMASK(CM2CON0), 7, a
#define CPOL                             BANKMASK(CM1CON0), 5, a
#define CPOL1                            BANKMASK(CM1CON0), 5, a
#define CPOL2                            BANKMASK(CM2CON0), 5, a
#define CREF                             BANKMASK(CM1CON0), 2, a
#define CREF1                            BANKMASK(CM1CON0), 2, a
#define CREF2                            BANKMASK(CM2CON0), 2, a
#define CREN1                            BANKMASK(RCSTA1), 4, a
#define CREN2                            BANKMASK(RCSTA2), 4, a
#define CS                               BANKMASK(PORTE), 2, a
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CSRC2                            BANKMASK(TXSTA2), 7, a
#define CTED1                            BANKMASK(PORTB), 2, a
#define CTED2                            BANKMASK(PORTB), 3, a
#define CTMUEN                           BANKMASK(CTMUCONH), 7, b
#define CTMUIE                           BANKMASK(PIE3), 3, a
#define CTMUIF                           BANKMASK(PIR3), 3, a
#define CTMUIP                           BANKMASK(IPR3), 3, a
#define CTMUMD                           BANKMASK(PMD2), 3, b
#define CTMUSIDL                         BANKMASK(CTMUCONH), 5, b
#define CTPLS                            BANKMASK(PORTC), 2, a
#define CTTRIG                           BANKMASK(CTMUCONH), 0, b
#define CVREF                            BANKMASK(PORTA), 2, a
#define DA                               BANKMASK(SSP1STAT), 5, a
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, a
#define DACEN                            BANKMASK(VREFCON1), 7, b
#define DACLPS                           BANKMASK(VREFCON1), 6, b
#define DACNSS                           BANKMASK(VREFCON1), 0, b
#define DACOE                            BANKMASK(VREFCON1), 5, b
#define DACOUT                           BANKMASK(PORTA), 2, a
#define DACPSS0                          BANKMASK(VREFCON1), 2, b
#define DACPSS1                          BANKMASK(VREFCON1), 3, b
#define DACR0                            BANKMASK(VREFCON2), 0, b
#define DACR1                            BANKMASK(VREFCON2), 1, b
